app/views/users/_unfollow.erb

SELECT "relationships".* FROM "relationships" WHERE "relationships"."follower_id" = 100 AND "relationships"."followed_id" = 4 LIMIT 1
---
<%= form_for(current_user.relationships.find_by_followed_id(@user),html: { method: :delete },remote: true) do |f| %>