app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "100"]]
---
  def followers
    @title="followers"
    @user=User.find(params[:id])